#!/bin/bash

test_file="test.txt"
programm="../dtchange"

function test_access(){	
	echo "      [Правильные данные]"
	echo ""
	
	$programm -a $test_file -t 20:30:40
	echo "Изменения времени доступа"
	echo "-------------------------------------"
	echo "Входные данные: время 20:30:40"
	stat $test_file | grep -w "20:30:40"
	echo "-------------------------------------"
	echo ""
	
	$programm -a $test_file -d 03:12:2015
	echo "Изменения даты доступа"
	echo "-------------------------------------"
	echo "Входные данные: дата 03:12:2015"
	stat $test_file | grep -w "2015-12-03"
	echo "-------------------------------------"
	echo ""
	
	$programm -a $test_file -t 20-30-40 -d 03.12.2015
	echo "Изменения даты и времени доступа"
	echo "-------------------------------------"
	echo "Входные данные: время 20-30-40, дата 03.12.2015"
	stat $test_file | grep -w "2015-12-03 20:30:40"
	echo "-------------------------------------"
	echo ""
	
	$programm -a $test_file
	echo "Изменения даты и времени доступа"
	echo "-------------------------------------"
	echo "Входные данные: текущее вермя"
	stat $test_file | grep "Доступ: "
	echo "-------------------------------------"
	echo ""
	
	echo "      [Неправильные данные]"
	echo ""
	
	echo "Изменения даты доступа"
	echo "-------------------------------------"
	echo "Входные данные: время 20:03 2015"
	$($programm -a $test_file -d 20:03 2015)
	echo "-------------------------------------"
	echo ""
	
	echo "Изменения времени доступа"
	echo "-------------------------------------"
	echo "Входные данные: время 20 30 40"
	$($programm -a $test_file -t 20 30 40)
	echo "-------------------------------------"
	echo ""
	
	echo "Неверный аргумент"
	echo "-------------------------------------"
	echo "Входные данные: параметр -w, время 20-15-45"
	$($programm -a $test_file -w 20-15-45)
	echo "-------------------------------------"
	echo ""
}

test_access
